{
    "10": {
        "news_date_time": "April6,2023",
        "news_title": "Dead by Daylight Leaks – All Upcoming Survivors & Killers Cosmetics Leaked!",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/dead-by-daylight-dbd-playstation-ps4-ps5-xbox-game-pass-nintendo-switch-behaviour-interactive-leaks.jpg",
        "news_description": "New cosmetics are coming inside dead by daylight with Mid-Chapter 27.5, in addition to the licensed one in collaboration with...",
        "news_link": "https://www.leaksbydaylight.com/dead-by-daylight-leaks-cosmetics/",
        "news_text": "New cosmetics are coming inside dead by daylight with Mid-Chapter 27.5, in addition to the licensed one in collaboration with Ash vs Evil Dead Tv Series:On April 18, in fact, new cosmetics will be released for: - Haddie (Very Rare) \n- Felix (Very Rare) \n- Thalita: Skin + chroma of the new outfit (Very Rare) \n- Renato: Skin + chroma of the new outfit (Very Rare) - The Skull Merchant (Very Rare) \n- The Knight (Very Rare)On May 2, new cosmetics will be released for:- Elodie (Very Rare) - Jeff (Very Rare) - Yui (Very Rare)- Zarina (Very Rare)- The Deathslinger (Very Rare)Inside the Mid-Chapter 27.5 Rift will be the following cosmetics:- Renato: Skin + chroma of the new outfit (Very Rare) \n- Talitha: Skin + chroma of the new outfit (Very Rare) \n- The Skull Merchant: Skin + chroma of the new outfit (Very Rare) \n- Ash: Skin + chroma of the new outfit (Ultra Rare) \n- Doctor: Skin + chroma of the new outfit (Very Rare)A new skin for The Trapper and a new skin for Jane will also be released.*Note: I would also remind you that all of this is subject to change by Behaviour Interactive until it is officially announced, as always when it comes to leaks.What do you think about all this?"
    },
    "11": {
        "news_date_time": "March30,2023",
        "news_title": "Dead by Daylight X Ash Vs Evil Dead Tv Series: Licensed Content COMING! + Anti-Camp Mechanic Leaked & New Cosmetics!",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/ash-vs-evil-dead-playstation-ps4-ps5-xbox-game-pass-nintendo-switch-dbd-gaming-games-xbox-game-pass-nintendo-switch-ash-j-williams-leaksbydaylight-dead-by-daylight.jpg",
        "news_description": "After the announced collaboration with Youtooz: Click here if you don't know anything about it! New contents are coming to...",
        "news_link": "https://www.leaksbydaylight.com/dead-by-daylight-x-evil-dead-more/",
        "news_text": "After the announced collaboration with Youtooz:New contents are coming to Dead by Daylight including new skins for The Skull Merchant, Zarina Kassir, Elodie Rakoto and Haddie Kaur, and, as anticipated in a recent article, Resident Evil-themed sales and even Spring Sale:Also in development is a mechanic called AntiCamp whose very file was found within the game files called AntiCampProtoUI.uasset, this mechanic should finally help survivors avoid playing with killers who make it very difficult to save survivors from hooks with anti-sportive techniques. It is not yet known what it will consist of but it is quite curious how Behaviour Interactive has changed its mind about this as well, in fact until a few years ago, the developers said camping was a game mechanic.A new licensed collaboration with the TV series Ash vs. Evil Dead is also on the way:\nAsh J. Williams will in fact receive a new legendary skin based to the TV show, and it will be a skin that will also have new lines of dialogue.What do you think about all this?"
    },
    "12": {
        "news_date_time": "March22,2023",
        "news_title": "Dead by Daylight Leaks: Resident Evil Sales, Board Game, All Upcoming Cosmetics & More Leaked!",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/dead-by-daylight-resident-evil-dbd-playstation-ps4-ps5-xbox-game-pass-nintendo-switch-board-game-leaksbydaylight-gaming-games-game.jpg",
        "news_description": "In addition to the leaked Alice in Wonderland-themed skins I mentioned a few minutes ago: Click here if you don't...",
        "news_link": "https://www.leaksbydaylight.com/dead-by-daylight-cosmetics-sales-board-game/",
        "news_text": "In addition to the leaked Alice in Wonderland-themed skins I mentioned a few minutes ago:More news is coming inside Dead by Daylight, in fact for those who own Dead by Daylight and Meet Your Maker (Behaviour Interactives new game), there will be some exclusive items that can be obtained in both games (the same thing was done with Deathgarden if you remember). \nThere will also be rainy sales from April 11 to April 18, and from March 31 to April 5 there will be specific sales on Resident Evil characters.Not only this, in fact new skins are coming including the Techwear Collection and the Dead by Daylight board game is also coming.Everything that is coming can be seen here:What do you think about all this?"
    },
    "13": {
        "news_date_time": "March22,2023",
        "news_title": "Dead by Daylight X Alice In Wonderland Cosmetics LEAKED!",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/dead-by-daylight-alice-in-wonderland-leaksbydaylight-dbd-playstation-ps4-ps5-xbox-game-pass-nintendo-switch.jpg",
        "news_description": "A few weeks ago I told you about the arrival of Alice in Wonderland-themed skins, and today banners and skins...",
        "news_link": "https://www.leaksbydaylight.com/dead-by-daylight-x-alice-in-wonderland-leaks/",
        "news_text": "A few weeks ago I told you about the arrival of Alice in Wonderland-themed skins, and today banners and skins have been leaked that will be for the following characters:- The Huntress (Very Rare)- The Artist (Ultra Rare)\n- Nea Karlsson (Very Rare) \n- Ace Visconti (Very Rare)\n- Kate Denson (Very RareThe banners and the cosmetics dedicated to them are as follows:Alices Adventures in Wonderland (commonly Alice in Wonderland) is an 1865 English novel by Lewis Carroll, a mathematics professor at Oxford University. It details the story of a young girl named Alice who falls through a rabbit hole into a fantasy world of anthropomorphic creatures. It is seen as an example of the literary nonsense genre. \nThe artist John Tenniel provided 42 wood-engraved illustrations for the book. It received positive reviews upon release and is now one of the best-known works of Victorian literature; its narrative, structure, characters and imagery have had widespread influence on popular culture and literature, especially in the fantasy genre. It is credited as helping end an era of didacticism in childrens literature, inaugurating an era in which writing for children aimed to \"delight or entertain\". \nThe tale plays with logic, giving the story lasting popularity with adults as well as with children. The titular character Alice shares her given name with Alice Liddell, a girl Carroll knew. The book has never been out of print and has been translated into 174 languages. Its legacy covers adaptations for screen, radio, art, ballet, opera, musicals, theme parks, board games and video games. Carroll published a sequel in 1871 entitled Through the Looking-Glass and a shortened version for young children, The Nursery \"Alice\" in 1890.These themed skins will be released on April 6 within Dead by Daylight."
    },
    "14": {
        "news_date_time": "March17,2023",
        "news_title": "Dead by Daylight Leaks – All Upcoming Cosmetics Leaked: Alice In Wonderland Skins & More!",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/alice-in-wonderland-dead-by-daylight-cosmetics-dbd-playstation-ps4-ps5-xbox-game-pass-nintendo-switch-leaksbydaylight.jpg",
        "news_description": "A few weeks ago I told you about the arrival of Alice in Wonderland-themed skins: Click here if you don't...",
        "news_link": "https://www.leaksbydaylight.com/dead-by-daylight-alice-in-wonderland-more/",
        "news_text": "A few weeks ago I told you about the arrival of Alice in Wonderland-themed skins:And today all the characters who will receive those themed skins, which will be released on April 6, 2023, have been leaked.In fact, the Alice in Wonderland skins will be received by Nea, Ace, Kate, The Huntress, and The Artist.But the news did not end there, in fact new skins belonging to a collection called Techwear Collection are on the way and will be released on March 23 and will belong to The Legion, Yun-Jin, Meg, Mikaela and Vittorio Toscano. Finally, there will be skins that will be limited time and will be for Dwight and Adam: Dwights skin will be released on March 23, while Adams will be released on March 31. Finally, I would like to remind you that all this belongs to leaked and unofficial material and that everything can change until Behaviour Interactive releases it.What do you think about all this?"
    },
    "15": {
        "news_date_time": "March14,2023",
        "news_title": "Dead by Daylight X Meet Your Maker: Licensed Charms Leaked + Gas Heaven Rework, New Scratch Marks & Sales!",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/DEAD-BY-DAYLIGHT-meet-your-maker-dbd-leaksbydaylight-ps4-ps5-xbox-game-pass-nintendo-switch-oscar.jpg",
        "news_description": "Some time ago I told you about the arrival of an event in collaboration with Behaviour Interactive's new game, Meet...",
        "news_link": "https://www.leaksbydaylight.com/dead-by-daylight-x-meet-your-maker-more/",
        "news_text": "Some time ago I told you about the arrival of an event in collaboration with Behaviour Interactives new game, Meet Your Maker:Well the charms and a new icon power that will be part of the new event within Dead by Daylight have been leaked:Not only this, in fact the rework of Gas Heaven and 30% Sales on some cosmetics are coming, and, thanks to Benj, new scratch marks have been found within the game files:What do you think about all this?"
    },
    "16": {
        "news_date_time": "March7,2023",
        "news_title": "Dead by Daylight X Meet Your Maker Event + Double Rift Fragments & Sales Leaked!",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/DEAD-BY-DAYLIGHT-leaksbydaylight-dbd-playstation-tools-of-torment-ps4-ps5-xbox-game-pass-nintendo-switch.jpg",
        "news_description": "The new chapter of Dead by Daylight was released today, bringing the game to v6.6.0 with the arrival of two...",
        "news_link": "https://www.leaksbydaylight.com/dead-by-daylight-meet-your-maker-sales-leaks/",
        "news_text": "The new chapter of Dead by Daylight was released today, bringing the game to v6.6.0 with the arrival of two new survivors and a new killer. In addition, changes have been made to some perks and the Red Forest realm.\nToday in addition to all this, new discounts coming and new events within Dead by Daylight have been leaked.\nSome time ago I told you about the new event in conjunction with Behaviour Interactives new game, Meet Your Maker:"
    },
    "17": {
        "news_date_time": "March2,2023",
        "news_title": "Dead by Daylight – The 7th Anniversary Chapter 28 Will Be Licensed: Leaked",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/dead-by-daylight-leaksbydaylight-playstation-ps4-ps5-xbox-game-pass-nintendo-switch-alien-predator-tools-of-torment.jpg",
        "news_description": "A few months ago, I was the only one to anticipate that the March chapter would be original, and today,...",
        "news_link": "https://www.leaksbydaylight.com/dead-by-daylight-anniversary-chapter-28-leaked/",
        "news_text": "A few months ago, I was the only one to anticipate that the March chapter would be original, and today, I am the only one to tell you at the moment that from the information I have, the next chapter of Dead by Daylight will be licensed, and it will be a collaboration that will surprise fans.I want to make one thing clear, on LeaksByDaylight I dont take leaks for granted, you wont read phrases like Chapter 28 is licensed, hello Pennywise or anything like that, it doesnt belong to me, those bamboozles I leave to others.Like all the articles on this site regarding leaks, I repeat to you in this one that leaks do not belong to confirmed material, but are leaks belonging to material that changes from day to day. That said, the source is the same one that allowed me to anticipate than everyone else, that the Resident Evil chapter with Nemesis would have two survivors instead of one, remember that article?And of course it is the same one that allowed me to anticipate two months ago that Chapter 27 would be original, however, I have to say that all those who thought it was bullshit, made me laugh so much, but I have to thank all those who show intelligence by noticing how, indeed in that title there were no question marks or phrases that hinted at a could be.LeaksByDaylight was born out of a passion for Dead by Daylight, but mostly out of a desire to update my friends on updates and leaks to the game, and when I had the opportunity to update more people on that product, I said, why not?So the possibility of creating a community about my favorite game had arisen, the first one about the game leaks, and so it was. For example I had a lot of fun when I anticipated the arrival of Stranger Things by 3 months by even creating a theme intro with the names of the game developers and then posting it on Youtube.Today, LBD is not just about Dead by Daylight Leaks, because I like video games, movies, and TV series, and so I like to keep you updated as well on what I think might be interesting to share, so those who deem what I write above as bullshit make me smile, because they clearly dont know the slightest bit about what LeaksByDaylight is, how it came about, and why.Getting back to us though, this is still an article referring to Dead by Daylight, so...I was saying, on the information I currently have, the next chapter to celebrate the games seventh anniversary will be in collaboration with a license, and always speaking of leaks, there is another one that points to having Alien inside the game from Behaviour Interactive:Who knows, maybe the next chapter will be original, and this article will go the way of the Leatherface leak, but at least i never gave you any leaks for sure, in every article of any leak i repeat to you that it is not confirmed material and everything can change, leaks passed off as official confirmation just to have clout i leave it to others, i prefer not making fun of you. Even when an article is about a speculation, I make it clear to you"
    },
    "18": {
        "news_date_time": "February19,2023",
        "news_title": "Dead by Daylight Leaks – The Upcoming Skull Merchant Changes Leaked!",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/DEAD-BY-DAYLIGHT-dbd-playstation-ps4-ps5-xbox-game-pass-nintendo-switch-tools-of-torment-skull-merchant.jpg",
        "news_description": "As you may know, a few days ago the PTB went online to test the new chapter of Dead by...",
        "news_link": "https://www.leaksbydaylight.com/dead-by-daylight-leaksskull-merchant-changes/",
        "news_text": "As you may know, a few days ago the PTB went online to test the new chapter of Dead by Daylight which contains a new killer and two new survivors.Just about the killer the community was not satisfied with the design and power, and Behaviour Interactive is making several changes, some of which were recently leaked:• Undetectable delay reduced to 2 seconds (was 3 seconds) \n• Claw Trap battery life increased to 45 seconds (was 25 seconds) • Energy cooldown reduced to 10 seconds (from 12.5 seconds). \n• Time for a drone to become active after spawning decreased to 3 seconds (was 4 seconds) \n• Decline lock delay increased to 10 seconds (was 5 seconds) \n• Movement speed modifier when inspecting radar increased to 95% (was 87%)• Lock On no longer depletes while in range of active drone \n• Lock On activates immediately if the survivor fails to hack a drone • Exposure lock duration increased to 60 seconds (was 30 seconds) • Unreachable drone duration increased to 10 seconds (was 5 seconds) • Time for a drone in active mode to switch to reconnaissance mode decreased to 20 seconds (was 25 seconds) Please note that these changes may change until the official release of the chapter on March 7.What do you think about it?"
    },
    "19": {
        "news_date_time": "February18,2023",
        "news_title": "Dead by Daylight X Alice In Wonderland: Licensed Crossover Leaked!",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/DEAD-BY-DAYLIGHT-dbd-leatherface-game-playstation-ps4-ps5-xbox-game-pass-nintendo-switch-gaming-texas-chainsaw-massacre-ALICE-in-wonderland-tools-of-torment.jpg",
        "news_description": "On Dead by Daylight is probably going to arrive a new licensed collaboration, quite unexpected because it does not concern...",
        "news_link": "https://www.leaksbydaylight.com/dead-by-daylight-x-alice-in-wonderland/",
        "news_text": "On Dead by Daylight is probably going to arrive a new licensed collaboration, quite unexpected because it does not concern the world of horror products.Behaviour Interactive will in fact release in a few weeks, after the release of Chapter 27, a new collection of skins themed Alice In Wonderland.For the moment the characters that will be part will be The Artist and Kate Denson, this is the official theme:Alices Adventures in Wonderland (commonly Alice in Wonderland) is an 1865 English novel by Lewis Carroll, a mathematics professor at Oxford University. It details the story of a young girl named Alice who falls through a rabbit hole into a fantasy world of anthropomorphic creatures. It is seen as an example of the literary nonsense genre. The artist John Tenniel provided 42 wood-engraved illustrations for the book. It received positive reviews upon release and is now one of the best-known works of Victorian literature; its narrative, structure, characters and imagery have had widespread influence on popular culture and literature, especially in the fantasy genre. It is credited as helping end an era of didacticism in childrens literature, inaugurating an era in which writing for children aimed to \"delight or entertain\". The tale plays with logic, giving the story lasting popularity with adults as well as with children. The titular character Alice shares her given name with Alice Liddell, a girl Carroll knew. The book has never been out of print and has been translated into 174 languages. Its legacy covers adaptations for screen, radio, art, ballet, opera, musicals, theme parks, board games and video games. Carroll published a sequel in 1871 entitled Through the Looking-Glass and a shortened version for young children, The Nursery \"Alice\" in 1890.New content has also been leaked coming soon, such as the event with the game Meet Your Maker and new skins coming soon including Shirtless Renato:For those who dont know, Alice in Wonderland has gone into the public domain so doing a collaboration is equivalent to not having to be under any agreement with any other company.I would also remind you that another licensed collaboration, the one with Predator, should be coming to Dead by Daylight in June:Excited?"
    }
}