{
    "0": {
        "news_date_time": "April5,2023",
        "news_title": "Dead by Daylight – Upcoming Changes About Healing, The Hillbilly, Autohaven Maps & Perks!",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/dead-by-daylight-ps4-ps5-xbox-game-pass-nintendo-switch-playstation-leaksbydaylight.jpg",
        "news_description": "Changes are coming within Dead by Daylight from the recent PTB. Regarding healing, the healing time is restored to 16...",
        "news_link": "https://www.leaksbydaylight.com/dead-by-daylight-changes-hillbilly-autohaven-more/",
        "news_text": "Camping Aid Kit: Increases the speed that you heal others by 35%, \nFirst Aid Kit: Increases the speed that you heal others by 40%. \nEmergency Med-Kit: Increases the speed that you heal others by 45%. \nRanger Med-Kit: Increases the speed that you heal others by 50%.There are also changes to the medikit addons:What do you think about all this?"
    },
    "1": {
        "news_date_time": "March30,2023",
        "news_title": "Dead by Daylight X Youtooz: ITS OFFICIAL! The Trickster, Bunny Feng Min, The Huntress & The Wraith COMING!",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/dead-by-daylight-dbd-playstation-ps4-ps5-xbox-game-pass-nintendo-switch-youtooz.jpg",
        "news_description": "A short while ago I told you that the collaboration between Funko Pop and Dead by Daylight had been canceled:...",
        "news_link": "https://www.leaksbydaylight.com/dead-by-daylight-x-youtooz-official/",
        "news_text": "A short while ago I told you that the collaboration between Funko Pop and Dead by Daylight had been canceled:And many fans had suggested several alternatives, including Youtooz. Well today it is official that Dead by Daylight characters will receive products in collaboration with Youtooz, specifically the first four will be The Trickster, Bunny Feng Min, The Huntress & The Wraith!No word yet on when they will be released, but Behaviour Interactive had actually said that new collaborations were on the horizon, and after the Dead by Daylight movie was announced:Here comes a new collaboration for the worlds most popular asymmetric horror game.Are you excited?"
    },
    "2": {
        "news_date_time": "March24,2023",
        "news_title": "Dead by Daylight Upcoming News: Freddy Krueger, Pyramid Head & More Killers Changes, Map, Bloodwebs & Perks Updates and More!",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/dead-by-daylight-playstation-ps4-ps5-xbox-game-pass-nintendo-switch-gaming-games-horror-krueger-pyramid-head.jpg",
        "news_description": "The PTB with numerous new features for Dead by Daylight will be released next week: Buying items within the bloodweb...",
        "news_link": "https://www.leaksbydaylight.com/dead-by-daylight-upcoming-news-changes/",
        "news_text": "The PTB with numerous new features for Dead by Daylight will be released next week:Buying items within the bloodweb will be faster thanks to a new button that will automatically buy all the cheapest items until the canvas is completed, and it will also be possible to activate an option to buy items with a single button without having to hold down, and also an entire node.It will be possible to activate an option to make a red heart appear in the survivor when the killer is nearby and terror radius is activated:As mentioned a while ago, there will be changes within the Autohaven Wreckers realm, precisely the layouts of some map areas will be revised as well as the arrangement of pallets within Blood Lodge and Gas Heaven, in the latter map for example the gas station will be put more in the center of the map.Healing will now take 24 seconds and all medical kits have 24 charges by default, and the various rarities will differentiate for faster healing speed.There are also changes to some perks:- Gearhead will receive a slight rework: When a Survivor loses a Health State, Gearhead activates for 30 seconds. While active, any Survivor who hits a good skill check will have their aura revealed to the Killer for 6/7/8 seconds.- Overzealous will also activate when Blessing a Totem in addition to Cleansing. Weve also slightly increased the bonus to 8/9/10% (from 6/7/8%).- Scourge Hook: Pain Resonance starts with 4 tokens, the first time each Survivor is hooked on a Scourge Hook, the generator with the most progress will explode and lose progress. Weve also reduced the difference between different Tiers of the perk (now 11/13/15%).- Dead Hard will activate after safely unhooking a Survivor. When activated, press the active ability button while injured and running to gain the Endurance Status Effect for 0.5 seconds, then become Exhausted. Dead Hard will deactivate when it successfully protects the user from damage.- Call Of Brine: reduced the additional regression speed to 115/120/125% (was 150/175/200%). - Overcharge: reduced the maximum regression speed to 130% (was 200%). This would make it take longer for the regression rate to become beneficial, so at the same time, weve increased the starting regression speed to 85% (was 75%) to help offset this.- Boon: Circle of Healing will no longer allow Survivors to heal without a Med-Kit. Instead, it will provide a 40/45/50% healing speed bonus to healing others. This bonus will not apply to healing done with a Med-Kit. Additionally, the auras of injured Survivors with the Boons range will be revealed to all other Survivors.There are also changes to numerous killers and the interactions you can have with them using different items:There is also news regarding rifts:All of this will be possible to try out in the PTB that will be released on PC next week.What do you think about all this?"
    },
    "3": {
        "news_date_time": "March17,2023",
        "news_title": "Dead by Daylight – The Skull Merchant Upcoming Changes Revealed & More!",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/tools-of-torment-chapter-dead-by-daylight-dbd-playstation-ps4-ps5-xbox-game-pass-nintendo-switch-skull-merchant-games-gaming-leaksbydaylight.jpg",
        "news_description": "New changes are coming for Dead by Daylight's new killer, The Skull Merchant: - The Skull Merchant will now gain...",
        "news_link": "https://www.leaksbydaylight.com/dead-by-daylight-skull-merchant-news/",
        "news_text": "New changes are coming for Dead by Daylights new killer, The Skull Merchant:- The Skull Merchant will now gain a growing Haste effect for each Survivor tracked on her radar. This bonus starts at 3% for one Survivor, raises to 5% for two, 6% for three and 7% for four. Both Claw Traps and active drone zones will contribute to this, and the Killer does not need to inspect their scanner to gain the benefits. This will reward the Killer for efficiently using their Power to keep tabs on their prey.- Vaulting a pallet with a Claw Trap will cause that pallet to break, destroying the Claw Trap in the process. This was previously part of the common Ultrasonic Trap Speaker Add-on. With this change, being chased with a Claw Trap attached becomes a lot more dangerous.- Drones are no longer immediately returned to The Skull Merchant once they are disabled. Instead, they will be returned once their respective traps are destroyed. This will make it more difficult to replace disabled drones on these generators.- To ensure Survivors cannot hold a Claw Trap indefinitely to deny her from using her Power, Claw Traps will now be instantly destroyed as soon as their battery expires, and Claw Trap batteries will no longer refill when entering an active zone. This way, Claw Traps will always return after a set amount of time.- Drones will enter an unhackable state whenever a Survivor with a Claw Trap is near. This will prevent a single Survivor from running around and disabling every drone, meaning the Killer will always have some combination of four Claw Traps or drones available to them. Combined with the changes to Claw Traps mentioned above, The Skull Merchant will always get value out of her ability whether its through deployed drones or traps.There are also changes to some add-ons:- Ultrasonic Trap Speaker: Ultrasonic Trap Speaker now reduces the time taken for Undetectable to take effect when inside an active zone by 50%.\n- Expired Batteries: Since Claw Traps now provide a Haste effect, this would make the Killer very fast at the start of the match in addition to revealing the Survivors positions. Therefore, we have reduced the duration of the Claw Traps Survivors spawn with to 40% of the normal battery life (was 150%).\n- Adaptive Lighting: Adaptive Lighting now increases the length of the Undetectable effect by 50% (was 20%).Finally, there is also a change regarding the screams within the game, in fact they will no longer be 3D screams but 2D screams, this means that it will no longer be possible to tell where the scream is coming from within the map, but it will be possible to hear it from any corner of the map itself.Excited about all this?"
    },
    "4": {
        "news_date_time": "March11,2023",
        "news_title": "Alien X Dead by Daylight: Teaser from Behaviour Interactive?",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/DEAD-BY-DAYLIGHT-playstation-ps4-ps5-xbox-game-pass-nintendo-switch-alien-horror-game.jpg",
        "news_description": "Since the last time I told you about the next chapter of Dead by Daylight being licensed, you have contacted...",
        "news_link": "https://www.leaksbydaylight.com/alien-x-dead-by-daylight-teaser/",
        "news_text": "Since the last time I told you about the next chapter of Dead by Daylight being licensed, you have contacted me expressing your curiosity about who Behaviour Interactives next collaboration might be, and just in the last hour you have made me curious by pointing out a peculiarity of an image posted via the games forum.In fact, in the Dead by Daylight forum, in the image dedicated to the Lunar New Year skins, there is the survivor mimicking the number 3 with his hands, and inside the rabbit depicted behind him, there seems to be some sort of form of the Cowering Alien:Many of you have pointed out to me that that 3 could be a way of indicating Alien 3, and thus the arrival of a June collaboration.Just a few days ago I told you about the likelihood that Alien could be the new license coming to Dead by Daylight, after the collaboration with Fortnite last year:But lets take a step back for a moment: what is Alien?But lets take a step back for a moment: what is Alien?For those who dont know what Im talking about, Alien was born in 1979from an idea by Dan OBannon and Ronald Shusett, directed by Since 1979, the fanbase of Alien has become huge, and huge is also the Since 1979, the fanbase of Alien has become huge, and huge is also the desire that the community has to see it on Dead by Daylight. On the other hand after the Demogorgon from Stranger Things, Ghostface from Scream, Pyramid Head from Silent Hill, the Nemesis from Resident Evil and all the other licensed contents, nothing seems impossible, and so dreaming is more than permissible, but there is something that could make these dreams, something actually real.The license of Alien in fact has found a way to assert itself in the world of video games thanks to Alien: Isolation, a first-person shooter horror game developed by The Creative Assembly and published by SEGA in 2014, and that is considered one of the most successful horror single player games and one of the very few tie-ins worthy of note, with an incredible artificial intelligence and well-groomed technical side.And now, in addition to the teaser I told you about a little while ago, a new film is also on the way, the first details of which are already known:About the Alien on Dead by Daylight, there is currently no news on it, but if it happened, would you like it?"
    },
    "5": {
        "news_date_time": "March6,2023",
        "news_title": "Terrifier Producer Would Love To Collaborate With Dead by Daylight",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/dead-by-daylight-terrifier-dbd-playstation-ps4-ps5-xbox-game-pass-nintendo-switch-horror-movies.jpg",
        "news_description": "A few years ago, the game director of Dead by Daylight, Mathieu Cote, said in an interview that the game...",
        "news_link": "https://www.leaksbydaylight.com/terrifier-dead-by-daylight/",
        "news_text": "A few years ago, the game director of Dead by Daylight, Mathieu Cote, said in an interview that the game had reached such popularity that it was not only Behaviour Interactive that was contacting companies to make collaboration agreements, but that the opposite was also happening, and just in that sense in fact a collaboration with Terrifier could take place.For those who dont know what Terrifier was, it is an indie horror slasher film directed, scripted, edited, and co-produced by Damien Leone whose sequel was released late last year to good success at the box office and also in the publics opinions.The film revolves around Art the Clown, a murderous clown played by David Howard Thornton, and features numerous gory scenes so much so that some viewers experienced bouts of vomiting and fainting during viewing.The sequel was critically acclaimed, and thanks in part to the excellent box office, a third sequel is also planned.Recently, producer Steve Barton said he was open to a collaboration with Dead by Daylight in response to a fan on Twitter:But this is not the first time that Steve Barton has talked about a collaboration with Dead by Daylight, in fact right after the theatrical release of the films sequel, it was the producer himself who made a tweet about it:This would not be the first time Behaviour Interactive has collaborated with indie realities; in fact, it had already happened with CryptTV a few years ago:So collaboration with Terrifier would not be completely impossible, I would also remind you that according to a leak, the next chapter will be in collaboration with a license:Would you like it?"
    },
    "6": {
        "news_date_time": "March2,2023",
        "news_title": "DEAD BY DAYLIGHT THE MOVIE ANNOUNCED WITH BLUMHOUSE, JAMES WAN & ATOMIC MONSTER!",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/dead-by-daylight-movie-blumhouse-dbd-playstation-ps4-ps5-xbox-game-pass-nintendo-switch-blumhouse.jpg",
        "news_description": "When Behaviour Interactive announced the cancellation of the collaboration with Funko Pop, they had actually said that there would be...",
        "news_link": "https://www.leaksbydaylight.com/dead-by-daylight-movie/",
        "news_text": "When Behaviour Interactive announced the cancellation of the collaboration with Funko Pop, they had actually said that there would be exciting new collaborations on the horizon, but I dont think anyone expected such an announcement.In fact, a Dead by Daylight movie in collaboration with Blumhouse and Atomic Monster has been officially announced!In the information shared on their official website in fact there are some interesting statements about it:We couldnt be more thrilled to work with Jason Blum and James Wan, two giants of the horror film industry, to further expand the Dead by Daylight universe. Atomic Monster and Blumhouse are the ideal partners to craft Dead by Daylights killer entrance onto the big screen. says Stephen Mulrooney, Executive Vice President at Behaviour Interactive.\n\nIn Dead by Daylight the Behaviour team has created a love letter to the world of horror, building an incredible environment teeming with atmosphere and terrifying villains — perfect for a scary cinematic adaptation, adds James Wan, Atomic Monster Founder and CEO. Were big fans of the game at Atomic Monster, and are thrilled to be teaming up with Blumhouse to bring this frighteningly visceral world to the big screen.The names around this project are very important, but there is certainly one that stands out most of all: James Wan, author of such successful sagas as Saw, Insidious and The Conjuring.Jason Blum is currently looking for a director and a screenwriter. \nThe producers of the project are James Wan, Jason Blum and Stephen Mulrooney, and the executive producers are Behaviour Interactives Rmi Racine, Atomic Monsters Michael Clear and Judson Scott, Blumhouses Ryan Turek, and Striker Entertainments Russell Binder.What do you think about it?"
    },
    "7": {
        "news_date_time": "March1,2023",
        "news_title": "The Next Dead by Daylight Licensed Chapter Will Be ALIEN: Announcement During Alien Day",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/dead-by-daylight-alien-day-leaksbydaylight-ps4-ps5-xbox-game-pass-nintendo-switch-predator-tools-of-torment-chapter.jpg",
        "news_description": "After the excessive coincidences between the last chapter of Dead by Daylight and Predator, I told you about the fact...",
        "news_link": "https://www.leaksbydaylight.com/dead-by-daylight-alien-day/",
        "news_text": "After the excessive coincidences between the last chapter of Dead by Daylight and Predator, I told you about the fact that Predator is probably actually coming to Dead by Daylight in June:Also because the anniversary chapters, except for a few times, has always been in collaboration with some license, and all those Predator-themed clues contained in the last chapter could actually mean teasers to the next upcoming licensed content.There is, however, another license that has always been wanted by the Dead by Daylight community, namely the collaboration with Alien, which a few years ago was also the victim of a fake image that made fans hope for the actual arrival of the creature within the game:I then told you about the probable arrival of the chapter on Alien for the seventh anniversary already last year, on more than one occasion:But lets take a step back for a moment: what is Alien?For those who dont know what Im talking about, Alien was born in 1979 from an idea by Dan OBannon and Ronald Shusett, directed by Ridley Scott and produced by 20th Century Fox, still considered one of the masterpieces of Ridley Scott and one of the best science fiction films ever. After the incredible success of the first film, others followed, with some crossover films with Predator, but no film succeeded in surprising as the first of Ridley Scott.Since 1979, the fanbase of Alien has become huge, and huge is also the desire that the community has to see it on Dead by Daylight. On the other hand after the Demogorgon from Stranger Things, Ghostface from Scream, Pyramid Head from Silent Hill, the Nemesis from Resident Evil and all the other licensed contents, nothing seems impossible, and so dreaming is more than permissible, but there is something that could make these dreams, something actually real.The license of Alien in fact has found a way to assert itself in the world of video games thanks to Alien: Isolation, a first-person shooter horror game developed by The Creative Assembly and published by SEGA in 2014, and that is considered one of the most successful horror single player games and one of the very few tie-ins worthy of note, with an incredible artificial intelligence and well-groomed technical side.From that moment on, fans of Alien began to grow even within video games, eager to see maybe an Alien: Isolation 2, which due to the uninspiring sales of the first chapter, has not yet become reality. And it is therefore on Dead by Daylight that all hopes are shifted to finally see Alien in a well-known horror product, after arriving on Fortnite in 2021.So why could Alien actually arrive on Dead by Daylight? The answer is very simple, never before as in this period, this license is being exploited in many ways in the videogames, from the 2021 Multiplayer CO-OP Aliens Fireteam Elite, to the 2021 collaboration with Fortnite I told you about before, the announcement a few months ago of a new Alien game in 2023, and also a new announcement months ago about another"
    },
    "8": {
        "news_date_time": "February26,2023",
        "news_title": "Youtooz Would Like To Collaborate With Dead by Daylight After The Funko Pop Problems",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/youtooz-dead-by-daylight-funko-pop-dbd-playstation-ps4-ps5-xbox-game-pass-nintendo-switch-games-gaming-game.jpg",
        "news_description": "I recently told you about the collaboration between Funko Pop and Dead by Daylight that was cancelled after some concepts...",
        "news_link": "https://www.leaksbydaylight.com/youtooz-dead-by-daylight/",
        "news_text": "I recently told you about the collaboration between Funko Pop and Dead by Daylight that was cancelled after some concepts of what would be released products were also shared:Within that article I had also told you about the fact that many fans have suggested a collaboration with Youtooz to replace the canceled deal with Funko Pop, and today came a tweet from the company saying they are happy to collaborate with Dead by Daylight:So a collaboration with them might actually come, fans seem excited if it actually happens.Would you guys like it?"
    },
    "9": {
        "news_date_time": "February25,2023",
        "news_title": "Dead by Daylight X Funko POP: Collaboration Cancelled",
        "news_pictures": "https://www.leaksbydaylight.com/lbd-images/funko-pop-dead-by-daylight-dbd-leaksbydaylight-playstation-ps4-ps5-xbox-game-pass-nintendo-switch.jpg",
        "news_description": "On May 16, 2022, I anticipated that the collaboration between Funko Pop and Dead by Daylight was coming, and the...",
        "news_link": "https://www.leaksbydaylight.com/dead-by-daylight-funko-pop/",
        "news_text": "On May 16, 2022, I anticipated that the collaboration between Funko Pop and Dead by Daylight was coming, and the next day it was actually announced with even the first concepts:The community was very happy because funko pops are a very popular product among fans all over the world, so even Dead by Daylight fans could finally have their Funko Pops of their favorite characters from the famous horror video game.However, word came from Behaviour Interactive that the collaboration has been discontinued and will never see the light of day:The reasons for the lack of collaboration between Dead by Daylight and Funko Pop may be that the company is currently not in good shape, a number of artists have been laid off and there was a class action lawsuit that forced the company to pay 7 million to resolve claims it misled its investors about the size of its inventory and its sales projections.Lately the company has not been sailing in good waters, and this can also be noticed by the value of its shares, which has dropped incredibly in the last 6 months:However, the developers wanted to reiterate not to worry because exciting new collaborations are on the way, and there are already those who are thinking about a collaboration with Youtooz.What do you think about all this?"
    }
}